//#include <stdio.h>//形成自己的代码习惯和代码思维
//头文件（预处理）预编译 库函数 
//注释：不参与代码运行 
//main 程序的入口 有且仅有一个 
int main(){//所有的c语言代码文件里面都有一个主函数 而且只能有一个main函数 
	//main函数（主函数）所有的代码写完头文件紧接着要有主函数
	//int（返回） 
	//大空格\t 
//	printf("\t<★<☆<★\n"); //形状用缩写wjx 
//	printf("\n");//c语言中的换行 
	//分号代表一句话的结束 
	//printf（输出，打印） 
} 
//c语言的特点：
				//1.高效性： 
				//2.灵活性： 
				//3.功能丰富：
				//4.表达力强：
				//5.移植性好：
#include <stdio.h>//包含头文件 	int（整形） 
int main(){		//主函数 
	printf("hello world");//函数体- 
	//printf-库函数-在屏幕上打印信息（引用头文件）-（stdio.h) 
} //函数语法格式
//返回值类型 函数名字（）
//{
//函数体 
}
 
 //注释多行:/*   内容   */
 //注释一行:// 
 //sccanf(输入）	printf(输出) 
